<?php
class CV {
	//qa unlogin
	const UNLOGIN_ASK = 999;
	const UNLOGIN_ANSWER = 1000;
	const UNLOGIN_SELF_QUESTION = 1001;
	const UNLOGIN_SELF_ANSWER = 1002;

	//question
	const SUBMIT_QUESTION_SUCCESS = 1;
	const SUBMIT_QUESTION_FAILED= 2;
	const LOGIN_FOR_SUBMIT_QUESTION= 3;
	const HOT_VIEW_NUM = 100;
	const QUESTION_CLOSE_TIMES = 604800;
	const QA_SUBMIT_ANSWER_SUCCESS = 4;

	//question list panel type
	const UNSOLVED_QUESTION = 1;
	const SOLVED_QUESTION = 2;
	const LATEST_ZHOUBIAN = 3;
	const LATEST_GUONEI = 4;
	const LATEST_CHUJING = 5;
	const LATEST_ZIYOU = 6;

	//question for self
	const SELF_QUESTION='my-question';
	const SELF_ANSWER='my-answer';

	//question for category
	const CAT_Q_LATEST='latest';
	const CAT_Q_UNSOLVED='unsolved';
	const CAT_Q_SOLVED='solved';
	const CAT_Q_HOT='hot';

	//flash info type
	const SUCCESS = 'success';
	const FAIL= 'fail';
	const TIP= 'tip';

	//login panel
	const LOGIN_TOP = 'top';
	const LOGIN_PAGE = 'page';
	const LOGIN_QA = 'qa';

	//user panel
	const UNLOGIN_USER=2000;

	const RETURN_USER_INDEX=2001;
	const RETURN_USER_CREDIT=2002;
	const RETURN_USER_DISTRIBUTION=2003;
	const RETURN_USER_EMAIL=2004;
	const RETURN_USER_HEAD=2005;
	const RETURN_USER_ORDER=2006;
	const RETURN_USER_PASSWORD=2007;
	const RETURN_USER_REVIEWS=2008;
	const RETURN_USER_VISITORS=2009;
	const RETURN_USER_HISTORY=2010;

	const SUCCESS_OPERATE=2010;
	const SUCCESS_EDITIN=2011;
	const SUCCESS_PASSWORD=2012;
	const ERROR_DATABASE=2013;
	const ERROR_CODE=2014;
	const ERROR_USER_PHONE=2015;
	const SEND_PHONE_FAILED=2016;
	

	const UNLOGIN_ORDER=3000;
	const RETURN_TRAVE_ORDER=3001;
	const ERROR_PAY=3002;
	const ERROR_PAYCODE=3003;
	const FAILED_TOTAL_COUPON=3004;
	const FAILED_USER_COUPON=3005;
	const FAILED_ZERO_COUPON=3006;
	const RETURN_TRAVE_FORDER=3007;
	const SUCCESS_TRAVE_OPERATE=3008;
	const FAILED_TRAVE_OPERATE=3009;

	const UNLOGIN_COMMENT=4000;
	const RETURN_TRAVE_COMMENT=40001;

	const REGISTE_ACTIVECODE=5000;

	//user image
	const DEFAULT_HEAD_IMG = "/css/images/tp50_50.jpg";


	//hot view & topic
	const HOT_VIEW = 0;
	const TOPIC = 1;

	/*
	 * ajax
	 */
	const AJAX_UNLOGIN_CODE = 1;
	const AJAX_SUBMIT_SUCCESS_CODE = 2;
	const AJAX_SUBMIT_ERROR_CODE = 3;
	const AJAX_SYSTEM_ERROR_CODE = 4;

	/**
	 * return type
	 */
	const RETURN_QA_ASK = 1;
	const RETURN_QA_ANSWER = 2;
	const RETURN_QA_SELF = 3;
	//const RETURN_QA_SELF = 4;

	//admin config
	const RETURN_ADMIN_INDEX=10000;
	const SUCCESS_ADMIN_OPERATE=10001;
	const FAILED_ADMIN_OPERATE=10002;
	const ERROR_ADMIN_DATABASE=10003;
	const FAILED_ADMIN_OPERATE_USER_EMAIL=10004;

	const CODE_WIDTH=120;
	const CODE_HEIGHT=18;
	const CODE_FONT_SIZE=12;
	const CODE_CHARS_COUNT=5;
	const CODE_LINES_COUNT=10;
	const CODE_CHAR_COLORS="#880000,#008800,#000088,#888800,#880088,#008888,#000000";
	const CODE_LINE_COLORS="#DD6666,#66DD66,#6666DD,#DDDD66,#DD66DD,#66DDDD,#666666";
	const CODE_BG_COLOR="#FFFFFF";
	const CODE_ALLOWED_CHARS="ABCDEFGHJKLMNPQRSTUVWXYZ2345689";
	const PATH_TTF="protected/extensions/imagecode/fonts";

	//ip_filter status
	const IP_FORBIDDEN = 1;
	const IP_APPROVE = 2;

	public static $RETURN_URL= array(
		self::RETURN_QA_ASK=>'qa/ask',
		self::RETURN_QA_ANSWER=>'qa/view',
		self::RETURN_QA_SELF=>'qa/self',
		self::RETURN_USER_INDEX=>'user/index',
		self::RETURN_USER_CREDIT=>'user/credit',
		self::RETURN_USER_DISTRIBUTION=>'user/distribution',
		self::RETURN_USER_EMAIL=>'user/email',
		self::RETURN_USER_HEAD=>'user/head',
		self::RETURN_USER_ORDER=>'user/order',
		self::RETURN_USER_PASSWORD=>'user/password',
		self::RETURN_USER_REVIEWS=>'user/reviews',
		self::RETURN_USER_VISITORS=>'user/visitors',
		self::RETURN_USER_HISTORY=>'user/history',
		self::RETURN_TRAVE_ORDER=>'travel/travelorder',
		self::RETURN_TRAVE_COMMENT=>'travel/traveldetail',
		self::RETURN_TRAVE_FORDER=>'travel/travelforder',
		self::RETURN_ADMIN_INDEX=>'user/index',
	);

	static $AD_AREAS=array(
		'' => array(
			'label' => '选择广告位置',
		),
	
		'1' => array(
			'label' => '首页中间--首页显示特价下面',
			'width' => '688',
			'height' => '70',
		),
		'2' => array(
			'label' => '首页中间--首页周热门下面',
			'width' => '688',
			'height' => '70',
		),
		'3' => array(
			'label' => '首页中间--首页月热门下面',
			'width' => '688',
			'height' => '70',
		),
		'4' => array(
			'label' => '首页中间--首页易途推荐下面',
			'width' => '688',
			'height' => '70',
		),

		
		'6' => array(
			'label' => '首页右边--小广告图片1',
			'width' => '220',
			'height' => '75',
		),
		
		
		'31' => array(
			'label' => '首页右边--小广告图片2',
			'width' => '220',
			'height' => '75',
		),
		
		
		'32' => array(
			'label' => '首页右边--小广告图片3',
			'width' => '220',
			'height' => '75',
		),
		

		
		
		'8' => array(
			'label' => '周边旅游页左边--top',
			'width' => '740',
			'height' => '70',
		),


		'11' => array(
			'label' => '国内旅游页左边--top',
			'width' => '740',
			'height' => '70',
		),
		'14' => array(
			'label' => '出境旅游页左边--top',
			'width' => '740',
			'height' => '70',
		),
		'17' => array(
			'label' => '自助旅游页左边--top',
			'width' => '740',
			'height' => '70',
		),

		
		'20' => array(
			'label' => '团队旅游页左边--top',
			'width' => '740',
			'height' => '70',
		),

		'23' => array(
			'label' => '特价旅游页左边--top',
			'width' => '740',
			'height' => '70',
		),

		'24' => array(
			'label' => '特价旅游页右边搜索--线路搜索下面',
			'width' => '208',
			'height' => '74',
		),
		
		
		'26' => array(
			'label' => '周边线路右边搜索和线路详细页--线路搜索下面',
			'width' => '208',
			'height' => '74',
		),
		
		
		'27' => array(
			'label' => '国内线路右边搜索和线路详细页--线路搜索下面',
			'width' => '208',
			'height' => '74',
		),
		
		
		'28' => array(
			'label' => '出境线路右边搜索和线路详细页--线路搜索下面',
			'width' => '208',
			'height' => '74',
		),
		
		'18' => array(
			'label' => '自助旅游右边搜索和线路详细页--线路搜索下面',
			'width' => '208',
			'height' => '74',
		),
		
		'30' => array(
			'label' => '公司线路右边搜索和线路详细页--线路搜索下面',
			'width' => '208',
			'height' => '74',
		),
		
		'33' => array(
			'label' => '旅游资讯右边搜索和线路详细页--线路搜索下面',
			'width' => '208',
			'height' => '74',
		),
	);


	static $REGULAR_MONTH=array('1'=>'每月','2'=>'一月','3'=>'二月','4'=>'三月','5'=>'四月','6'=>'五月','7'=>'六月','8'=>'七月','9'=>'八月','10'=>'九月','11'=>'十月','12'=>'十一月','13'=>'十二月');

	static $REGULAR_DAY=array('1'=>'天天','2'=>'星期一','3'=>'星期二','4'=>'星期三','5'=>'星期四','6'=>'星期五','7'=>'星期六','8'=>'星期天');

	static $HOTEL_LEVEL=array('5'=>'五星','4'=>'四星','3'=>'三星','2'=>'二星','1'=>'一星');

	static $ROOM_BED=array('1'=>'大床','2'=>'双床','3'=>'大/双床');

	static $ROOM_PEOPLE=array('1'=>'1人','2'=>'2人','3'=>'3人','4'=>'4人');

	static $ROOM_DINNING=array('1'=>'无','2'=>'双份自助餐','3'=>'一份自助餐','4'=>'一份桌早');

	static $ROOM_BROADBAND=array('1'=>'免费','2'=>'收费','3'=>'无');

	static $PACKAGE=array('1'=>'是','2'=>'不是');

	static $RATING_VALUES=array(''=>'评分','5'=>'5','4'=>'4','3'=>'3','2'=>'2','1'=>'1');

	static $SEARCH_RATING_VALUES=array(''=>'评分','5'=>'5','4'=>'4','3'=>'3','2'=>'2','1'=>'1');

	static $BUDGET_DATAS=array(''=>'不限','5'=>'100以下 ','6'=>'100-300元','7'=>'300-500元','1'=>'500-1000元','2'=>'1000-2000元','3'=>'2000-3000元','4'=>'大于3000元');

	static $TRAVE_ROUTE_NUMBER=array(''=>'不限','1'=>'一天','2'=>'两天','3'=>'三天','4-6'=>'4天-6天','6-10'=>'6天-10天','10-'=>'大于10天');

	static $SEARCH_TRAVE_CATEGORY=array(''=>'不限','2'=>'周边游','3'=>'国内旅游','1'=>'出境游','5'=>'自助游','4'=>'团队旅游');

	static $ORDER_PRICE=array(''=>'订单总价','0-1000'=>'小于1000','1000-2000'=>'1000-2000元','2000-3000'=>'2000-3000元','3000-'=>'大于3000元');

	static $ORDER_STATUS=array(''=>'订单状态','1'=>'等待处理','2'=>'等待计调确认','3'=>'等待客服联系','4'=>'等待客户答复','5'=>'已发确认书','6'=>'转成正式订单','7'=>'已发团通知书','8'=>'取消订单');
	
  static $ADD_ORDER_STATUS=array('1'=>'等待处理','2'=>'等待计调确认','3'=>'等待客服联系','4'=>'等待客户答复','5'=>'已发确认书','6'=>'转成正式订单','7'=>'已发团通知书','8'=>'取消订单');


	static $PAY_STATUS=array(''=>'付款状态','1'=>'未付款','2'=>'已付全款','3'=>'已付部分款');

	static $PAY_STYLE=array(''=>'支付方式','1'=>'刷卡','5'=>'现金','2'=>'支付宝','4'=>'银行汇款');//'3'=>'易宝'
	
	static $ADMIN_PAY_STYLE=array('1'=>'刷卡','5'=>'现金','2'=>'支付宝','4'=>'银行汇款');//'3'=>'易宝'

	static $TRAVE_CATEGORY=array(''=>'线路类别','1'=>'出境游','2'=>'周边游','3'=>'国内游','4'=>'团队游','5'=>'自由行');

	static $ORDER_STYLE=array(''=>'下单方式','1'=>'网络预定','2'=>'电话预定','3'=>'门市预定');

	static $ORDER_SOURCE=array(''=>'来源地','1'=>'网络','2'=>'报纸','3'=>'老客户','4'=>'朋友介绍','5'=>'传单');

	static $ORDER_LEVEL=array(''=>'订单等级','1'=>'加急','2'=>'急','3'=>'一般','4'=>'不急');

	static $ONLINE_SURVEY_DATAS=array('1'=>'出游时间','2'=>'线路价格','3'=>'餐饮和住宿','4'=>'景点和行程安排','5'=>'导游讲解和服务');

	static $USER_LEVEL=array(''=>'用户等级','1'=>'普通会员','2'=>'高级会员','3'=>'黄金会员','4'=>'钻石会员');

	static $USER_LEVEL_SEARCH=array('1'=>'普通会员','2'=>'高级会员','3'=>'黄金会员','4'=>'钻石会员');

	static $CREDIT_TYPE=array(''=>'操作动作','1'=>'增加','2'=>'减少');

	static $COUPON_CATEGORY=array(''=>'消费类型','1'=>'使用抵用劵','2'=>'管理员修改','3'=>'购买线路');

	static $SUPPLIERS_SETTLE=array(''=>'不限','1'=>'未结算','2'=>'已结算部分','3'=>'已结算');

	static $AD_TYPE=array(''=>'选择广告类型','1'=>'图片','2'=>'flash','3'=>'文字');

	static $FILTER_SEARCH_LINE_TYPE=array('33','200','86','123','131','167','215','293','304');

	static $HELP_INDEX_IDS=array(2, 3, 4, 5, 6);

	static $CODE_TYPE=array('1'=>'身份证','2'=>'护照','3'=>'港澳通行证','4'=>'台胞证','5'=>'军官证','6'=>'其他');

	static $COUNTRY_LISTS=array("ALB"=>"阿尔巴尼亚","AZE"=>"阿塞拜疆","AFG"=>"阿富汗","DZA"=>"阿尔及利亚","AGO"=>"安哥拉","ATG"=>"安提瓜","ARG"=>"阿根廷","AUS"=>"澳大利亚","AUT"=>"奥地利","BLR"=>"白俄罗斯","BEN"=>"贝宁","BDI"=>"布隆迪","BHS"=>"巴哈马","BHR"=>"巴林","BRB"=>"巴巴多斯","BEL"=>"比利时","BGD"=>"孟加拉","BIH"=>"波黑","BRA"=>"巴西","BRN"=>"文莱","BGR"=>"保加利亚","CMR"=>"喀麦隆","TCD"=>"乍得","CRI"=>"哥斯达黎加","KHM"=>"柬埔寨","CAN"=>"加拿大","CYM"=>"开曼群岛","CAF"=>"中非","CHL"=>"智利","CHN"=>"中国","COL"=>"哥伦比亚","COG"=>"刚果","CIV"=>"科特迪瓦","HRV"=>"克罗地亚",
		"CUB"=>"古巴","CYP"=>"塞浦路斯","CZE"=>"捷克","DJI"=>"吉布提","PRK"=>"朝鲜","DNK"=>"丹麦","DOM"=>"多米尼加共和国","ECU"=>"厄瓜多尔","GNQ"=>"赤道几内亚","EGY"=>"埃及","EST"=>"爱沙尼亚","ETH"=>"埃塞俄比亚","FJI"=>"斐济","FIN"=>"芬兰","FRA"=>"法国","PYF"=>"法属玻利尼","GEO"=>"格鲁吉亚","GNB"=>"几内亚比绍","GAB"=>"加蓬","DEU"=>"德国","GHA"=>"加纳","GRC"=>"希腊","GRD"=>"格林纳达","GUM"=>"危地马拉","GIN"=>"几内亚","GUY"=>"圭亚那","HND"=>"洪都拉斯","HKG"=>"中国香港","HUN"=>"匈牙利","ISL"=>"冰岛","IND"=>"印度","IDN"=>"印度尼西亚","IRN"=>"伊朗","IRQ"=>"伊拉克",
		"IRL"=>"爱尔兰","ISR"=>"以色列","ITA"=>"意大利","JAM"=>"牙买加","JPN"=>"日本","JOR"=>"约旦","KAZ"=>"哈萨克斯坦共和国","KEN"=>"肯尼亚","KOR"=>"韩国","KWT"=>"科威特","KGZ"=>"吉尔吉斯斯坦","LAO"=>"老挝","LBN"=>"黎巴嫩","LSO"=>"莱索托","LBR"=>"利比里亚","LBY"=>"利比亚","LIE"=>"列支敦士登","LTU"=>"立陶宛","LUX"=>"卢森堡","MLI"=>"马里","MOZ"=>"莫桑比克","MAC"=>"澳门","MDG"=>"马达加斯加","MWI"=>"马拉维","MYS"=>"马来西亚","MDV"=>"马尔代夫","MLT"=>"马耳他","MUS"=>"毛里求斯","MEX"=>"墨西哥","MNG"=>"蒙古","MAR"=>"摩洛哥","MMR"=>"缅甸","NPL"=>"尼泊尔","NLD"=>"荷兰",
		"NCL"=>"新喀里多尼亚","NZL"=>"新西兰","NIC"=>"尼加拉瓜","NER"=>"尼日尔","NGA"=>"尼日利亚","MNP"=>"北玛里亚纳群岛","NOR"=>"挪威","OMN"=>"阿曼","PAK"=>"巴基斯坦","PSE"=>"巴勒斯坦","PAN"=>"巴拿马","PNG"=>"巴布亚新几内亚","PRY"=>"巴拉圭","PER"=>"秘鲁","PHL"=>"菲律宾","POL"=>"波兰","PRT"=>"葡萄牙","PRI"=>"波多黎各","QAT"=>"卡塔尔","RWA"=>"卢旺达","SLE"=>"塞拉里昂共和国","ROU"=>"罗马尼亚","RUS"=>"俄罗斯","SRB"=>"塞尔维亚","LCA"=>"圣卢西亚","SAU"=>"沙特阿拉伯","SGP"=>"新加坡","SVK"=>"斯洛伐克","SVN"=>"斯洛文尼亚","SOM"=>"索马里","ZAF"=>"南非",
		"ESP"=>"西班牙","LKA"=>"斯里兰卡","SDN"=>"苏丹","SUR"=>"苏里南","SWE"=>"瑞典","CHE"=>"瑞士","SYR"=>"叙利亚","TJK"=>"塔吉克斯坦","TGO"=>"多哥","TWN"=>"中华台湾","TZA"=>"坦桑尼亚","THA"=>"泰国","LVA"=>"拉脱维亚","MKD"=>"马其顿","SEN"=>"塞内加尔共和国","SYC"=>"塞舌尔共和国","MDA"=>"摩尔多瓦共和国","TTO"=>"特立尼达和多巴哥","TUN"=>"突尼斯","TUR"=>"土耳其","TKM"=>"土库曼斯坦","TCA"=>"特克斯和凯科斯群岛","URY"=>"乌拉圭","UGA"=>"乌干达","UKR"=>"乌克兰","ARE"=>"阿联酋","GBR"=>"英国","USA"=>"美国","UZB"=>"乌兹别克斯坦","VEN"=>"委内瑞拉",
		"VNM"=>"越南","YEM"=>"也门","DRC"=>"扎伊尔","ZMB"=>"赞比亚","ZWE"=>"津巴布韦","BLZ"=>"伯利兹","AND"=>"安道尔","AIA"=>"安圭拉","ARM"=>"亚美尼亚","ANT"=>"荷属安的列斯","ATA"=>"南极洲","ASM"=>"美属萨摩亚","ABW"=>"阿鲁巴","ALA"=>"奥兰群岛","BFA"=>"布基纳法索","BLM"=>"圣巴泰勒米岛","BMU"=>"百慕大","BOL"=>"玻利维亚","BTN"=>"不丹","BVT"=>"布韦岛","BWA"=>"博茨瓦纳","CCK"=>"科科斯群岛","COD"=>"刚果（金）；刚果民主共和国","COK"=>"库克群岛","CPV"=>"佛得角","CXR"=>"圣诞岛","DMA"=>"多米尼克","ESH"=>"西撒哈拉","ERI"=>"厄立特里亚","FLK"=>"马尔维纳斯群岛（福克兰群岛）",
		"FSM"=>"密克罗尼西亚联邦","FRO"=>"法罗群岛","GUF"=>"法属圭亚那","GGY"=>"格恩西岛","GIB"=>"直布罗陀","GRL"=>"格陵兰","GMB"=>"冈比亚","GLP"=>"瓜德罗普","SGS"=>"南乔治亚岛和南桑威奇群岛","GTM"=>"危地马拉","HMD"=>"赫德岛和麦克唐纳群岛","HTI"=>"海地","IMN"=>"马恩岛","IOT"=>"英属印度洋领地","JEY"=>"泽西岛","KIR"=>"基里巴斯","COM"=>"科摩罗","KNA"=>"圣基茨和尼维斯","MCO"=>"摩纳哥","MNE"=>"黑山","MAF"=>"法属圣马丁岛","MHL"=>"马绍尔群岛","MTQ"=>"马提尼克","MRT"=>"毛里塔尼亚","MSR"=>"蒙特塞拉特","NAM"=>"纳米比亚","NFK"=>"诺福克岛","NRU"=>"瑙鲁","NIU"=>"纽埃",
		"SPM"=>"圣皮埃尔和密克隆","PCN"=>"皮特凯恩群岛","PLW"=>"帕劳","REU"=>"留尼汪","SLB"=>"所罗门群岛","SHN"=>"圣赫勒拿","SJM"=>"斯瓦尔巴群岛和扬马延岛","SMR"=>"圣马力诺","STP"=>"圣多美和普林西比","SLV"=>"萨尔瓦多","SWZ"=>"斯威士兰","ATF"=>"法属南部领地","TKL"=>"托克劳","TLS"=>"东帝汶","TON"=>"汤加","TUV"=>"图瓦卢","UMI"=>"美国本土外小岛屿","VAT"=>"梵蒂冈","VCT"=>"圣文森特和格林纳丁斯","VGB"=>"英属维尔京群岛","VIR"=>"美属维尔京群岛","VUT"=>"瓦努阿图","WLF"=>"瓦利斯和富图纳","WSM"=>"萨摩亚","MYT"=>"马约特");

	static $GROUP_START_REGION=array("0"=>"请选择出发地","1"=>"上海","3"=>"杭州","4"=>"嘉兴","5"=>"富士山","6"=>"樱花","7"=>"宁波","9"=>"安吉","10"=>"义乌","11"=>"巴黎","12"=>"北京","13"=>"合肥","14"=>"黄山","16"=>"宣城","17"=>"芜湖","18"=>"蚌埠","19"=>"铜陵","20"=>"阜阳","21"=>"北京","22"=>"西双版纳","23"=>"大理","24"=>"昆明","25"=>"丽江","26"=>"腾冲","27"=>"香格里拉","28"=>"马鞍山","30"=>"淮北","31"=>"安庆","32"=>"六安","34"=>"淮南","35"=>"坝美村","36"=>"滁州","37"=>"普者黑","38"=>"罗平","39"=>"元谋土林","40"=>"元阳","41"=>"黄山市","42"=>"法国","43"=>"德国","44"=>"荷兰","45"=>"比利时","46"=>"卢森堡",
		"47"=>"意大利","48"=>"葡萄牙","49"=>"福州","50"=>"西班牙","51"=>"南平","52"=>"奥地利","53"=>"厦门","54"=>"龙岩","55"=>"瑞士","56"=>"莆田","58"=>"泉州","59"=>"漳州","60"=>"美国","61"=>"三明","62"=>"宁德","63"=>"海北","64"=>"海南","65"=>"黄南","66"=>"果洛","67"=>"海西","68"=>"海东","69"=>"西宁","70"=>"玉树","71"=>"海口","72"=>"三亚","73"=>"铁岭","74"=>"沈阳","75"=>"抚顺","76"=>"大连","77"=>"本溪","78"=>"锦州","79"=>"辽阳","80"=>"盘锦","81"=>"鞍山","82"=>"营口","83"=>"丹东","84"=>"阜新","85"=>"朝阳","95"=>"哈尔滨","96"=>"牡丹江","97"=>"绥化","98"=>"齐齐哈尔","99"=>"佳木斯","100"=>"黑河","102"=>"伊春","103"=>"大庆",
		"104"=>"七台河","105"=>"鹤岗","106"=>"双鸭山","107"=>"鸡西","108"=>"丹麦","109"=>"挪威","110"=>"芬兰","111"=>"俄罗斯","112"=>"冰岛","113"=>"英国","114"=>"武汉","115"=>"十堰","116"=>"恩施","117"=>"荆门","118"=>"鄂州","119"=>"咸宁","120"=>"随州","121"=>"襄樊","122"=>"黄岗","123"=>"荆州","124"=>"孝感","125"=>"神农架","126"=>"宜昌","127"=>"北京","141"=>"澳门","142"=>"香港","147"=>"高雄县","148"=>"花莲县","149"=>"基隆市","150"=>"嘉义县","151"=>"金门县","152"=>"马祖","153"=>"苗栗县","154"=>"南投县","155"=>"澎湖县","156"=>"屏东县","157"=>"台北市","158"=>"台东县","159"=>"台南","160"=>"台中县","161"=>"桃源县",
		"162"=>"新竹县","163"=>"宜兰县","165"=>"彰化县","166"=>"澳大利亚","167"=>"新西兰","168"=>"巴布亚新几内亚","169"=>"所罗门群岛","170"=>"加拿大","171"=>"墨西哥","172"=>"常州","173"=>"淮安","174"=>"昆山","175"=>"连云港","176"=>"南京","177"=>"南通","178"=>"苏州","179"=>"宿迁","180"=>"泰州","181"=>"无锡","182"=>"徐州","183"=>"盐城","184"=>"扬州","185"=>"镇江","187"=>"广州","188"=>"东莞","189"=>"梅州","190"=>"潮州","191"=>"汕尾","192"=>"汕头","193"=>"深圳","194"=>"佛山","195"=>"茂名","196"=>"江门","197"=>"清远","198"=>"韶关","199"=>"惠州","200"=>"河源","201"=>"湛江","202"=>"中山","203"=>"肇庆","204"=>"阳江","205"=>"珠海",
		"206"=>"揭阳","207"=>"南宁","208"=>"百色","209"=>"北海","210"=>"桂林","211"=>"柳州","212"=>"河池","213"=>"崇左","214"=>"钦州","215"=>"玉林","216"=>"梧州","217"=>"来宾","218"=>"贵港","219"=>"防城港","220"=>"云林县","221"=>"鞍山","222"=>"本溪","223"=>"朝阳","224"=>"大连","225"=>"丹东","226"=>"抚顺","227"=>"锦州","228"=>"沈阳","229"=>"铁岭","230"=>"兴城","231"=>"营口","232"=>"大理","233"=>"高雄县","234"=>"丽江","235"=>"昆明","236"=>"腾冲","237"=>"香格里拉","238"=>"西双版纳","239"=>"丽江","243"=>"埃及","244"=>"苏丹","245"=>"腾冲","246"=>"阿尔及利亚","247"=>"摩洛哥","248"=>"突尼斯","249"=>"利比亚","250"=>"尼日尔","251"=>"尼日利亚",
		"252"=>"乍得","253"=>"中非","254"=>"喀麦隆","255"=>"赤道几内亚","256"=>"加蓬","257"=>"刚果","258"=>"安哥拉","259"=>"赞比亚","260"=>"毛里求斯","261"=>"津巴布韦","262"=>"南非","264"=>"白城市","265"=>"白山市","266"=>"长白山区","267"=>"长春市","268"=>"激情滑雪体验区","269"=>"吉林市","270"=>"辽源市","271"=>"四平市","272"=>"松原市","273"=>"通化市","274"=>"延边朝鲜族自治区","275"=>"池州","276"=>"长乐","277"=>"福清","279"=>"闽江","280"=>"俄罗斯","281"=>"大兴安岭","282"=>"五大连池","283"=>"安阳","284"=>"鹤壁","285"=>"济源","286"=>"焦作","287"=>"开封","288"=>"洛阳","289"=>"漯河","290"=>"南阳","291"=>"平顶山","292"=>"濮阳","293"=>"三门峡",
		"294"=>"商丘","295"=>"新乡","296"=>"信阳","297"=>"许昌","298"=>"郑州","299"=>"周口","300"=>"驻马店","301"=>"福建省","302"=>"长治","305"=>"晋城","306"=>"晋中","307"=>"临汾","308"=>"吕梁","309"=>"朔州","310"=>"太原","311"=>"忻州","312"=>"阳泉","313"=>"运城","314"=>"大同","315"=>"肯尼亚","317"=>"重庆","318"=>"三峡","319"=>"云南","320"=>"日本","321"=>"韩国","322"=>"越南","323"=>"马来西亚","324"=>"新加坡","325"=>"泰国","326"=>"马尔代夫","327"=>"阿联酋","328"=>"缅甸","329"=>"柬埔寨","330"=>"罗马尼亚","331"=>"固原","332"=>"石嘴山","333"=>"吴忠","334"=>"银川","335"=>"中卫","336"=>"格尔木","337"=>"贵德","338"=>"敦煌",
		"339"=>"甘南","340"=>"嘉峪关","341"=>"金昌","342"=>"酒泉","343"=>"兰州","344"=>"临夏","345"=>"陇南","346"=>"平凉","347"=>"天水","348"=>"武威","349"=>"张掖","350"=>"吉安","351"=>"景德镇","352"=>"九江","353"=>"南昌","354"=>"上饶","355"=>"新余","356"=>"鹰潭","357"=>"赣州","358"=>"宜春","359"=>"抚州","360"=>"湖州","361"=>"金华","362"=>"丽水","363"=>"衢州","364"=>"绍兴","365"=>"台州","366"=>"温州","367"=>"舟山","368"=>"川北","369"=>"川东","370"=>"川南","371"=>"川西","372"=>"川中","373"=>"西安","374"=>"榆林","375"=>"延安","376"=>"咸阳","377"=>"宝鸡","378"=>"商洛","379"=>"渭南","380"=>"汉中","381"=>"铜川","382"=>"韩城",
		"383"=>"安康","384"=>"烟台","385"=>"滨州","386"=>"荷泽","387"=>"德州","388"=>"东营","389"=>"济南","390"=>"济宁","391"=>"莱芜","392"=>"聊城","393"=>"临沂","394"=>"青岛","395"=>"日照 ","396"=>"山东","397"=>"泰安","398"=>"威海","399"=>"滩坊","400"=>"枣庄","401"=>"淄博","402"=>"木渎","403"=>"诸葛八卦村","404"=>"周庄","405"=>"同里","406"=>"阿拉善盟","407"=>"巴彦淖尔","408"=>"包头","409"=>"赤峰","410"=>"鄂尔多斯","411"=>"呼和浩特","412"=>"呼伦贝尔","413"=>"通辽","414"=>"乌海","415"=>"乌兰察布","416"=>"锡林郭勒","417"=>"兴安盟","418"=>"南浔","419"=>"乌镇","420"=>"西塘","421"=>"朱家角","422"=>"乌鲁木齐","423"=>"石河子",
		"424"=>"吐鲁番","425"=>"昌吉","426"=>"喀什","427"=>"和田","428"=>"阿克苏","429"=>"哈密","430"=>"克拉玛依","431"=>"阿勒泰","432"=>"伊梨","433"=>"拉萨","434"=>"日喀则","435"=>"昌都","436"=>"林芝","437"=>"山南","438"=>"阿里","439"=>"那曲","440"=>"山南","441"=>"印度","442"=>"缅甸","443"=>"以色列","444"=>"文莱","445"=>"土耳其","446"=>"菲律宾","447"=>"云浮","449"=>"海南","450"=>"琼海市","451"=>"张家界","452"=>"长沙","453"=>"衡阳","454"=>"湘西","455"=>"常德","456"=>"岳阳","457"=>"娄底","458"=>"株洲","459"=>"湘潭","460"=>"益阳","461"=>"永州","462"=>"郴州","463"=>"邵阳","464"=>"怀化","465"=>"蜈支洲岛","466"=>"南沙群岛",
		"467"=>"西沙群岛","468"=>"黔北","469"=>"黔东","470"=>"黔西","471"=>"黔南","472"=>"黔中","473"=>"天津城","474"=>"蓟县","475"=>"塘沽","476"=>"宁河","477"=>"西青","478"=>"武清","479"=>"静海","480"=>"新疆","481"=>"承德","482"=>"石家庄","483"=>"保定","484"=>"秦皇岛","485"=>"张家口","486"=>"唐山","487"=>"沧州","488"=>"廊坊","489"=>"邯郸","490"=>"邢台","491"=>"衡水","492"=>"台湾","493"=>"成都","494"=>"曲阜","495"=>"贵阳","496"=>"遵义","498"=>"瑞典","499"=>"波兰","500"=>"爱沙利亚","501"=>"立陶宛","502"=>"白俄罗斯","503"=>"乌克兰","504"=>"捷克","505"=>"斯洛伐克","506"=>"匈牙利","507"=>"匈牙利","508"=>"保加利亚",
		"509"=>"希腊","510"=>"阿尔巴利亚","511"=>"阿尔巴尼亚","512"=>"斯洛文尼亚","513"=>"克罗地亚","514"=>"波黑","515"=>"黑山","516"=>"马其顿","517"=>"爱尔兰","518"=>"安道尔","519"=>"摩纳哥","520"=>"列支敦士登","521"=>"奥地利","522"=>"圣马力诺","523"=>"梵蒂冈","524"=>"马耳他","525"=>"印度尼西亚","526"=>"哥伦比亚","527"=>"委内瑞拉","528"=>"秘鲁","529"=>"厄瓜多尔","530"=>"玻利维亚","531"=>"巴拉圭","532"=>"圭亚那","533"=>"苏里南","534"=>"巴西","535"=>"智利","536"=>"阿根廷","537"=>"乌拉圭","538"=>"巴拿马","539"=>"百慕大","540"=>"加勒比海地区","541"=>"哥斯达黎加","542"=>"巴哈马","543"=>"尼加拉瓜","544"=>"洪都拉斯","545"=>"富阳",
		"546"=>"约旦","547"=>"长兴县","548"=>"内蒙古","549"=>"沙巴","550"=>"海参崴","551"=>"古巴","552"=>"甪直","553"=>"塔希提岛","554"=>"大溪地","555"=>"尼泊尔","556"=>"海宁","557"=>"老挝","559"=>"广西","560"=>"常熟","561"=>"临安","562"=>"余姚","564"=>"临安 ","565"=>"坦桑尼亚","566"=>"巢湖","567"=>"温岭","568"=>"山西","569"=>"河南","570"=>"河北","571"=>"江西","572"=>"陵水县","573"=>"宁夏","575"=>"朝鲜","576"=>"斐济","577"=>"布拉戈维申斯克","578"=>"宜兴","579"=>"江山","580"=>"绵阳","581"=>"北海道","582"=>"民丹岛","583"=>"斯里兰卡","584"=>"乐清","585"=>"阿曼苏丹国","586"=>"卡塔尔","587"=>"定安县","588"=>"保亭县","589"=>"建德");


	static $GROUP_REPLY_TIME=array("1"=>'尽快回复','2'=>'工作时间回复','3'=>'下班回复');

	static $GROUP_TRANSPORT=array("1"=>'汽车','2'=>'火车','3'=>'飞机','4'=>'轮船','5'=>'不需要安排');

	static $GROUP_STAY=array("1"=>'农家乐','2'=>'经济型','3'=>'三星','4'=>'四星','5'=>'五星','6'=>'不需要安排');

	static $GROUP_DINNING=array("1"=>'20元/人标准餐标','2'=>'30元/人餐标','3'=>'更高要求');

	static $GROUP_GUIDE=array("1"=>'中文导游','2'=>'中英文导游','3'=>'其他语言','4'=>'有景点介绍能力','5'=>'只需全程服务人员');

	static $GROUP_SHOPPING=array("1"=>'不需要','2'=>'少量安排','3'=>'正常安排');

	static $GROUP_MEETING=array("1"=>'需要安排','2'=>'不需要安排');

	static $TIP_TRAVE_CATEGORY=array('2'=>'周边游','3'=>'国内旅游','1'=>'出境游','5'=>'自助游','4'=>'团队旅游');
	
	
	static $WEP_CACHE=array('mainmenu'=>'首页导航条');

	static $CUSTOMIZESTATUS=array(''=>'处理状态','1'=>'未处理','2'=>'已处理');

	public static $HOT_OPTIONS =  array(self::HOT_VIEW=>'热景',self::TOPIC=>'主题');
	
	public static $REQUESTSEO =  array('travel'=>array('detail','nation','peripheral','group','free','domestic','bargain'),'site'=>array('index'),'guzhen'=>array('index'));
	
	public static $SEARCH_KEYWORDS = array('2'=>"十一特价,十一推荐,山水,海滨,温泉,美食,古镇水乡,周庄,西湖,天目湖,千岛湖,黄山,五星酒店,鼎立国际,盐城迎宾馆",'3'=>"十一特价,十一推荐,武夷山,厦门,青岛,海南,三亚,海口,成都,九寨沟,西藏,拉萨,云南,昆明,丽江,香格里拉,西双版纳,张家界,桂林,长白山,庐山,推荐,价格,要多少钱",'1'=>"十一特价,十一推荐,港澳游,台湾,台湾旅游,香港,澳门,欧洲,挪威,瑞士,意大利,澳洲,澳大利亚,新西兰,东南亚,日本,韩国,东京,普吉岛,巴厘岛,马尔代夫");

  public static $FENZHAN_STATUS = array('0'=>'未发布','1'=>'发布');
  public static $IP_STATUS = array('1'=>'禁用','2'=>'审核');
  public static $IP_NEVER_EXPIRE = "永不过期";
  public static $THREADS_TYPE=array(''=>'主题类型','1'=>"攻略",'2'=>"游记");
  
  
  public static $BATCH_TYPE = array('1'=>"邮件",'2'=>'短信');
  public static $SEARCH_BATCH_TYPE = array(''=>'信息类型','1'=>"邮件",'2'=>'短信');
  
  public static $cell_arr=array('1'=>'A','2'=>'B','3'=>'C','4'=>'D','5'=>'E','6'=>'F','7'=>'G','8'=>'H','9'=>'I','10'=>'J','11'=>'K','12'=>'L','13'=>'M','14'=>'N','15'=>'O','16'=>'P','17'=>'Q','18'=>'R','19'=>'S','20'=>'T','21'=>'U','22'=>'V','23'=>'W','24'=>'X','25'=>'Y','26'=>'Z');

  }
?>
